espressif/esp-idf/examples/ethernet/basic/sdkconfig.ci.alternate_esp32p4
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y

CONFIG_EXAMPLE_ETH_PHY_INTERFACE_RMII=y
# CONFIG_EXAMPLE_ETH_RMII_CLK_INPUT is not set
CONFIG_EXAMPLE_ETH_RMII_CLK_OUTPUT=y
CONFIG_EXAMPLE_ETH_RMII_CLK_GPIO=23
CONFIG_EXAMPLE_ETH_RMII_CLK_EXT_LOOPBACK_EN=y

CONFIG_EXAMPLE_ETH_DEINIT_AFTER_S=10

CONFIG_EXAMPLE_ETH_PHY_RST_TIMING_EN=y
